test/dummy/app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
---
  def some_random_helper
    User.count

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ('sdf', 22, '2025-05-15 21:59:04.583907', '2025-05-15 21:59:04.583907') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def set_user
      @user = User.find(params.expect(:id))