test/dummy/app/models/user.rb

  def self.some_random_code
    x = User.last
    age = User.maximum(:age)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
SELECT MAX("users"."age") FROM "users"