test/dummy/app/views/users/_user.html.erb

    <strong>Age:</strong>
    <%= user.age %> / <%= User.maximum(:age) %>
---
SELECT "users".* FROM "users"
SELECT MAX("users"."age") FROM "users"